silabs-bozont/ArduinoCore-zephyr/boards.txt
niclasense.build.zephyr_target=arduino_nicla_sense_me
niclasense.build.zephyr_args=
niclasense.build.zephyr_hals=hal_nordic
niclasense.build.artifact=zephyr_main
niclasense.build.variant=arduino_nicla_sense_me_nrf52832
niclasense.build.mcu=cortex-m4
niclasense.build.fpu=-mfpu=fpv4-sp-d16
niclasense.build.architecture=cortex-m4

niclasense.build.float-abi=-mfloat-abi=hard
niclasense.build.extra_flags=
niclasense.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
niclasense.build.architecture=cortex-m4
niclasense.build.board=ARDUINO_NICLA_SENSE_ME
niclasense.vid.0=0x2341
niclasense.pid.0=0x0360
niclasense.upload_port.0.vid=0x2341
niclasense.upload_port.0.pid=0x0060

#niclasense.upload.tool=openocd
#niclasense.upload.tool.default=openocd
niclasense.upload.tool=pyocd
niclasense.upload.tool.default=pyocd
niclasense.upload.protocol=
niclasense.upload.transport=
niclasense.upload.vid=0x2341
niclasense.upload.pid=0x0060
niclasense.upload.interface=0
niclasense.upload.use_1200bps_touch=false
niclasense.upload.wait_for_upload_port=false
niclasense.upload.native_usb=false
niclasense.upload.maximum_size=1966080
niclasense.upload.maximum_data_size=523624
niclasense.upload.address=0x70000
niclasense.upload.target=nrf52

niclasense.upload.maximum_size=786432
niclasense.upload.maximum_data_size=523624

#niclasense.bootloader.tool=openocd
#niclasense.bootloader.tool.default=openocd
niclasense.bootloader.tool=pyocd
niclasense.bootloader.tool.default=pyocd
niclasense.bootloader.vid=0x2341
niclasense.bootloader.pid=0x0360
niclasense.bootloader.interface=0
niclasense.bootloader.file=zephyr-{build.variant}.hex
niclasense.bootloader.target=nrf52

niclasense.debug.tool=gdb
niclasense.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
niclasense.debug.server.openocd.scripts.1={programmer.transport_script}
niclasense.debug.server.openocd.scripts.2=target/nrf52.cfg
niclasense.debug.cortex-debug.custom.request=attach


##########################################################################################

portentac33.name=Arduino Portenta C33
portentac33.build.core=arduino
portentac33.build.crossprefix=arm-zephyr-eabi-
portentac33.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

portentac33.menu.debug.false=Standard
portentac33.menu.debug.true=Debug
portentac33.menu.debug.true.build.zsk_args.debug=-debug

portentac33.menu.link_mode.dynamic=Dynamic
portentac33.menu.link_mode.static=Static
portentac33.menu.link_mode.static.build.link_mode=static
portentac33.menu.link_mode.static.upload.extension=bin-zsk.bin

portentac33.build.zephyr_target=arduino_portenta_c33
portentac33.build.zephyr_args=
portentac33.build.zephyr_hals=hal_renesas nanopb
portentac33.build.artifact=zephyr_main
portentac33.build.variant=arduino_portenta_c33_r7fa6m5bh3cfc
portentac33.build.mcu=cortex-m33
portentac33.build.fpu=-mfpu=fpv5-sp-d16
portentac33.build.architecture=cortex-m33

portentac33.build.float-abi=-mfloat-abi=hard
portentac33.build.extra_flags=
portentac33.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentac33.build.board=ARDUINO_PORTENTA_C33
portentac33.vid.0=0x2341
portentac33.pid.0=0x0068
portentac33.upload_port.0.vid=0x2341
portentac33.upload_port.0.pid=0x0068
portentac33.upload.target=portentac33

portentac33.upload.tool=dfu-util
portentac33.upload.tool.default=dfu-util
portentac33.upload.protocol=
portentac33.upload.transport=
portentac33.upload.vid=0x2341
portentac33.upload.pid=0x0368
portentac33.upload.interface=1
portentac33.upload.use_1200bps_touch=true
portentac33.upload.wait_for_upload_port=false
portentac33.upload.native_usb=true
portentac33.upload.maximum_size=1966080
portentac33.upload.maximum_data_size=523624
portentac33.upload.address=0x100000
portentac33.upload.dfuse=-Q -w

portentac33.bootloader.tool=dfu-util
portentac33.bootloader.tool.default=dfu-util
portentac33.bootloader.file=zephyr-{build.variant}.bin
portentac33.bootloader.interface=0
portentac33.bootloader.address=0x10000
portentac33.bootloader.dfuse=-Q

##########################################################################################

opta.name=Arduino Opta
opta.build.core=arduino
opta.build.crossprefix=arm-zephyr-eabi-
opta.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

opta.menu.debug.false=Standard
opta.menu.debug.true=Debug
opta.menu.debug.true.build.zsk_args.debug=-debug

opta.build.zephyr_target=arduino_opta//m7
opta.build.zephyr_args=
opta.build.zephyr_hals=hal_stm32 hal_infineon
opta.build.artifact=zephyr_main
opta.build.variant=arduino_opta_stm32h747xx_m7
opta.build.mcu=cortex-m7
opta.build.fpu=-mfpu=fpv5-d16
opta.build.architecture=cortex-m7

opta.build.float-abi=-mfloat-abi=softfp
opta.build.extra_flags=
opta.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
opta.build.architecture=cortex-m7
opta.build.board=ARDUINO_OPTA
opta.vid.0=0x2341
opta.pid.0=0x0064
opta.upload_port.0.vid=0x2341
opta.upload_port.0.pid=0x0364

opta.upload.tool=dfu-util
opta.upload.tool.default=dfu-util
opta.upload.protocol=
opta.upload.transport=
opta.upload.vid=0x2341
opta.upload.pid=0x0364
opta.upload.interface=0
opta.upload.use_1200bps_touch=true
opta.upload.wait_for_upload_port=true
opta.upload.native_usb=true
opta.upload.maximum_size=1966080
opta.upload.maximum_data_size=523624

opta.upload.address=0x080E0000

opta.upload.maximum_size=786432
opta.upload.maximum_data_size=523624

opta.bootloader.tool=dfu-util
opta.bootloader.tool.default=dfu-util
opta.bootloader.vid=0x2341
opta.bootloader.pid=0x0364
opta.bootloader.interface=0
opta.bootloader.file=zephyr-{build.variant}.bin
opta.bootloader.address=0x08040000

opta.debug.tool=gdb
opta.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
opta.debug.server.openocd.scripts.1={programmer.transport_script}
opta.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
opta.debug.cortex-debug.custom.request=attach
opta.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##############################################################################################################

unoq.name=Arduino UNO Q
unoq.build.core=arduino
unoq.build.crossprefix=arm-zephyr-eabi-
unoq.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

